Repository: 123outerme/cloudpebble
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru

source: Invalid username or password
ru: Неверный логин или пароль

source: Account disabled.
ru: Аккаунт заблокирован.

source: Invalid user GitHub tokens.
ru: Неверный токен GitHub.

source: Tap to enable developer mode and install apps from CloudPebble.
ru: Нажмите чтобы включить режим разработчика и разрешить установку приложений с CloudPebble.

source: Invalid Github URL.
ru: Неверный URL GitHub.

source: Could not save: file has been modified since last save.
ru: Невозможно сохранить: файл изменился после предыдущего сохранения.

source: Pending
ru: В ожидании

source: Failed
ru: Неудачно

source: Succeeded
ru: Успешно

source: Binary blob
ru: Бинарный файл

source: 1-bit PNG
ru: 1-бит PNG

source: 1-bit PNG with transparency
ru: 1-бит PNG с прозрачностью

source: True-Type Font
ru: Шрифт TrueType

source: Uploaded file too big.
ru: Слишком большой файл.

source: App
ru: Приложение

source: Worker
ru: Работник

source: Pebble.js (beta)
ru: Pebble.js (бета)

source: Template
ru: Шаблон

source: SDK Demo
ru: Демо SDK

source: Example
ru: Пример

source: As-you-type
ru: По ходу

source: When pressing Ctrl-Space
ru: По нажатию Ctrl+пробел

source: Never
ru: Никогда

source: Standard
ru: Стандартные

source: vim-like
ru: В стиле vim

source: emacs-like
ru: В стиле emacs

source: Using spaces
ru: Пробелами

source: Using tabs
ru: Табами

source: Autocompletion
ru: Автодополнение

source: Keybinds
ru: Комбинации клавиш

source: Theme
ru: Тема

source: Tab width
ru: Ширина таба

source: You are going to create a project based on a template.
ru: Вы собираетесь создать проект по шаблону.

source: Create Project
ru: Создать проект

source: Projects
ru: Проекты

source: Settings
ru: Настройки

source: Sign out
ru: Выход

source: All your projects
ru: Все проекты

source: Create
ru: Создать

source: Import
ru: Импорт

source: Project
ru: Проект

source: Last modified
ru: Последняя правка

source: Last built
ru: Последняя сборка

source: Successful
ru: Успешно

source: You don't have any projects yet.
ru: У вас пока ещё нет проектов.

source: Create New Project
ru: Создать проект

source: Project name
ru: Имя проекта

source: Project type
ru: Тип проекта

source: Empty project
ru: Пустой проект

source: Standard Templates
ru: Стандартные шаблоны

source: SDK demos
ru: Демо SDK

source: Examples
ru: Примеры

source: Cancel
ru: Отмена

source: Import Existing Project
ru: Импортировать существующий проект

source: Upload Zip
ru: Загрузить Zip

source: Import from GitHub
ru: Импорт из GitHub

source: Zip file
ru: Zip файл

source: This must be a zip file containing a standard Pebble project.
ru: Это должен быть zip файл со стандартным проектом Pebble.

source: GitHub Project
ru: Проект на GitHub

source: Branch (optional)
ru: Ветка (опционально)

source: Use as Git remote
ru: Использовать как git remote

source: Compilation
ru: Компиляция

source: Source files
ru: Исходные файлы

source: Add new
ru: Добавить

source: Worker source
ru: Код работника

source: Resources
ru: Ресурсы

source: Preparing autocomplete…
ru: Готовим автодополнение…

source: Create new file
ru: Создать файл

source: File type
ru: Тип файла

source: C file
ru: Файл C

source: JavaScript file
ru: Файл JavaScript

source: Window Layout
ru: Макет окна

source: Filename
ru: Имя файла

# compilation target
source: Target
ru: Цель

source: Background worker
ru: Фоновый процесс

source: Create header
ru: Создать заголовок

source: Window name
ru: Имя окна

source: That repo does not exist. Would you like to create it?
ru: Такой репозиторий не существует. Хотите создать его?

source: Repo Name
ru: Имя репозитория

source: Description <span class="muted">(optional)</span>
ru: Описание <span class="muted">(опционально)</span>

source: Push New Commit
ru: Сделать push нового коммита

source: Commit Summary
ru: Кратко о коммите

# sample commit summary
source: Fix something useful.
ru: Какое-то полезное исправление.

source: Extended description <span class="muted">(optional)</span>
ru: Расширенное описание <span class="muted">(опционально)</span>

source: Commit
ru: Коммит

source: Pull Latest Commit
ru: Сделать pull последнего коммита

source: <p>Are you sure you want to pull the latest commit? Doing so will <em>overwrite</em> everything currently in your project.</p> <p>There will be no further warnings and no opportunity to merge. This cannot be undone.</p>
ru: <p>Вы точно хотите сделать pull последнего коммита? Это <em>перезапишет</em> все, что у вас сейчас есть в проекте.</p> <p>Больше не будет предупреждений и не будет возможности сделать merge. Это не может быть отменено.</p>

source: Pulling latest commit from GitHub…
ru: Делаем pull последнего коммита с GitHub…

source: Install App
ru: Установить

source: Installing app on your watch…
ru: Устанавливаем приложение на часы…

source: Dismiss
ru: Закрыть

# button to look at logs
source: View logs
ru: Логи

source: Taking Screenshot
ru: Делаем скриншот

source: Taking screenshot…
ru: Делаем скриншот…

source: Okay
ru: ОК

source: Continue
ru: Продолжить

source: Editor settings
ru: Настройки редактора

source: Settings saved!
ru: Настройки сохранены!

source: Submit
ru: Применить

source: Reset
ru: Сбросить

source: GitHub Integration
ru: Интеграция с GitHub

source: Re-authenticate
ru: Войти снова

source: Unlink account
ru: Отвязать аккаунт

source: Link your GitHub account
ru: Привязать аккаунт GitHub

source: Connecting your GitHub account enables you to connect your projects to GitHub repositories.
ru: Подключение вашего аккаунта GitHub позволяет подключать ваши проекты к репозиториям GitHub.

source: Install and Run
ru: Установить и запустить

source: View app logs
ru: Посмотреть логи

source: Screenshot
ru: Скриншот

source: Status:
ru: Статус:

source: Size:
ru: Размер:

source: Available App RAM:
ru: Доступная приложению RAM:

source: Available Worker RAM:
ru: Доступная работнику RAM:

source: Run build
ru: Собрать

source: Get PBW
ru: Скачать PBW

source: Build log
ru: Лог сборки

source: Date
ru: Дата

source: Status
ru: Статус

source: Size
ru: Размер

source: Github Repo
ru: Репозиторий GitHub

# git branch
source: Branch
ru: Ветка

# button label
source: Pull changes
ru: Сделать pull изменений

source: Manually
ru: Вручную

source: Automatically
ru: Автоматически

source: If you select 'Automatically', the contents of this project <em>will be overwritten</em> every time you push to your repo from elsewhere, <em>without prompting you</em>.
ru: Если вы выберите 'Автоматически', содержимое этого проекта <em>будет перезаписываться</em> каждый раз вы будете делать push в ваш репозиторий откуда-то ещё <em>не спрашивая вас</em>.

source: After pulling
ru: После pull

source: Do nothing
ru: Ничего не делать

source: Build automatically
ru: Собирать автоматически

source: Save
ru: Сохранить

source: Resource type
ru: Тип ресурса

source: PNG image
ru: Картинка PNG

source: PNG with transparency
ru: PNG с прозрачностью

source: TrueType font
ru: Шрифт TrueType

source: Raw binary blob
ru: Бинарный файл

source: File
ru: Файл

source: You can have multiple Pebble resources from a single file (for different sizes, etc.)
ru: У вас может быть несколько ресурсов из одного файла (для разных размеров, и т. д.)

source: Download uploaded resource
ru: Скачать загруженный ресурс

source: Identifier
ru: Идентификатор

source: This is used in your code and must be a valid C identifier.
ru: Это используется в коде и должно быть валидным идентификатором в языке C.

source: It must end with the desired font size.
ru: Он должен заканчиваться предпочитаемым размером шрифта.

# like letters and numbers
source: Characters
ru: Символы

source: A PCRE regular expression that restricts characters.
ru: Регулярное выражение (PCRE) для ограничения символов.

source: Tracking adjust
ru: Подстройка

source: Number of additional pixels by which to shift each character.
ru: Количество дополнительных пикселей, на которое сдвинется каждый символ.

source: Delete
ru: Удалить

source: Another font
ru: Другой шрифт

source: App kind
ru: Вид приложения

source: Short App Name
ru: Короткое имя приложения

# sample app name
source: Demo App
ru: Демо-приложение

source: App's short name. This will appear on the watch.
ru: Короткое название, которое отображается на часах.

source: Long App Name
ru: Длинное имя приложения

source: App's long name. This will appear in the app list on the phone.
ru: Длинное название, которое отображается в списке на телефоне.

source: Menu image
ru: Изображение в меню

source: None
ru: Нет

source: Default
ru: По умолчанию

source: Displayed on the Pebble's main menu. Must be a 28x28 file in PNG format.
ru: Отображается в главном меню. Должно быть PNG размера 28x28.

source: Company Name
ru: Имя компании

# sample company name
source: Demo Company
ru: Демо-компания

source: Name of the app's developer.
ru: Название разработчика приложения.

source: Version label
ru: Номер версии

source: App version. Takes the format major[.minor], where major and minor are between 0 and 255.
ru: Версия приложения. Формат major[.minor], где major и minor между 0 и 255.

source: App UUID
ru: UUID приложения

source: A unique identifier for the app.
ru: Уникальный идентификатор приложения.

source: PebbleKit JS Message Keys
ru: Ключи PebbleKit JS

source: Key Name
ru: Имя ключа

source: Key ID
ru: ID ключа

source: New Entry
ru: Новая запись

source: A mapping from strings to integers used by PebbleKit JS.
ru: Конвертация из строк в числа используется PebbleKit JS.

# checkbox label
source: Check Javascript
ru: Проверять JavaScript

# checkbox label
source: Uses Location
ru: Использует местоположение

# checkbox label
source: Configurable
ru: Настраиваемое

source: Save changes
ru: Сохранить

source: Download as zip
ru: Скачать как zip

source: Delete Project
ru: Удалить проект

source: Properties
ru: Свойства

source: Toolkit
ru: Тулкит

source: Illegal include '%(include)s' -> '%(path)s'
ru: Неверный include '%(include)s' -> '%(path)s'

source: No project root found.
ru: Не найден корень проекта.

source: Unknown project type %s
ru: Неизвестный тип проекта %s

source: CloudPebble was created by Katharine Berry and is now run by Pebble.
ru: CloudPebble был создан Katharine Berry и сейчас в ведении Pebble.

source: Welcome Back
ru: Добро пожаловать

source: Here's what's changed since the last time you were here:
ru: Вот что поменялось с последнего вашего входа:

source: Sign in
ru: Войти

source: Close
ru: Закрыть

source: Already have a Pebble account?
ru: Уже есть аккаунт Pebble?

source: This is the same account you use to log in to the Pebble Forums, Developer Portal and phone app. Don't have a Pebble account? Create one!
ru: Это тот же аккаунт, что вы используете для входа в форумы Pebble, портал разработчиков и приложение на телефоне. Нет аккаунта Pebble? Создайте!

source: Log in with your Pebble account
ru: Войти при помощи аккаунта Pebble

source: Create Pebble account
ru: Создать аккаунт Pebble

source: Have a legacy CloudPebble account?
ru: Есть старый аккаунт CloudPebble?

source: Log in to link it with your Pebble account. Legacy accounts are being phased out in favour of the Pebble account system. Once you log in you will be required to link your accounts; henceforth you must log in with your pebble account.
ru: Войдите, чтобы связать его с вашим аккаунтом Pebble. Старые аккаунты заменяются на систему аккаунтов Pebble. После входа будет необходимо связять аккаунты.

source: Link to your Pebble account
ru: Связать с аккаунтом Pebble

source: Online Pebble Development
ru: Онлайн-разработка для Pebble

source: Write apps without dealing with Linux, virtual machines, compilers, or Python.
ru: Пишите приложения без настройки виртуальных машин, компиляторов, Linux и Python.

source: Get Started
ru: Начните сейчас

source: Nothing to install
ru: Не надо ничего устанавливать

source: Write apps directly in your browser. Skip all setup instructions!
ru: Пишите приложения прямо в браузере – без всякой установки!

source: No JSON to edit
ru: Не надо редактировать JSON

source: Resources are managed through a friendly user interface
ru: Управление ресурсами через удобный интерфейс

source: Cloudy
ru: Облачная

source: It's on the internet. Accessible from anywhere! That's a good thing, right?
ru: Она в интернете. Доступна откуда угодно! Это хорошо, так ведь?

source: More to come
ru: Дальше – больше

source: This is only the beginning!<br>There's much more to come.
ru: Это только начало!<br>Дальше – гораздо больше.

source: Log in with legacy account
ru: Войти при помощи старым аккаунтом

source: Username
ru: Логин

source: Password
ru: Пароль

source: Log in
ru: Войти

source: Due to a recent Chrome update, we have been forced to disable TLS site-wide. Security will be re-enabled in a few days.
ru: Из-за недавнего обновления Chrome мы были вынуждены отключить TLS. Безопасность будет вновь включена вскоре.

source: Make sure that the Developer Connection is enabled on your phone, and you are running at least iOS app version 2.5 or Android version 2.1 (beta).
ru: Убедитесь, что на телефоне включен Developer Connection, и что версия приложения хотя бы 2.5 (iOS) или 2.1 beta (Android).

# number of spaces
source: Indents
ru: Отступы

# date/time
source: Started:
ru: Начало:

# duration
source: Build time:
ru: Время:

source: Last build
ru: Последняя сборка

source: Download
ru: Скачать

source: Make sure that the Developer Connection is enabled on your phone, and you are running at least phone app version 2.5 (iOS) or <a id="android-beta-link" href="#">2.1.0-beta6 (Android)</a>.
ru: Убедитесь, что Developer Connection включен на вашем телефоне, и у версия приложения как минимум 2.5 (iOS) или <a id="android-beta-link" href="#">2.1.0-beta6 (Android)</a>.
