Repository: 123outerme/cloudpebble
Catalog: locale/*/LC_MESSAGES/djangojs.po
Languages: es, ru

source: Invalid username or password
es: Nombre de usuario o contraseña incorrectos

source: Account disabled.
es: Cuenta deshabilitada.

source: Invalid user GitHub tokens.
es: Token de usuario de GitHub no válido.

source: Tap to enable developer mode and install apps from CloudPebble.
es: Toca para habilitar el modo desarrollador e instalar aplicaciones desde CloudPebble.

source: Invalid Github URL.
es: URL de GitHub no válida.

source: Could not save: file has been modified since last save.
es: No se puede salvar: el archivo ha sido modificado desde el último guardado.

source: Pending
es: Pendiente
ru: В ожидании

source: Failed
es: Fallido
ru: Неудачно

source: Succeeded
es: Exitoso
ru: Успешно

source: Binary blob
es: Objeto binario

source: 1-bit PNG with transparency
es: 1-bit PNG con transparencia

source: True-Type Font
es: Fuente True-Type

source: Uploaded file too big.
es: El archivo cargado es demasiado grande.

source: App
es: Aplicación

source: Worker
es: Trabajador

source: Template
es: Plantilla

source: SDK Demo
es: Ejemplo de SDK

source: Example
es: Ejemplo

source: As-you-type
es: Según-escribes

source: When pressing Ctrl-Space
es: Mientras pulsas Crtl-Espacio

source: Never
es: Nunca

source: Standard
es: Estándar

source: vim-like
es: tipo vim

source: emacs-like
es: tipo emacs

source: Using spaces
es: Usando espacios

source: Using tabs
es: Usando tabulaciones

source: Autocompletion
es: Auto completo

source: Keybinds
es: Mapeo de teclas

source: Theme
es: Tema

source: Indents
es: Identaciones

source: Tab width
es: Ancho de pestaña

source: You are going to create a project based on a template.
es: Vas a crear un proyecto basado en una plantilla.

source: Create Project
es: Crear Proyecto.

source: Projects
es: Proyectos

source: Settings
es: Ajustes

source: Sign out
es: Salir

source: All your projects
es: Todos tus proyectos

source: Create
es: Crear

source: Import
es: Importar

source: Project
es: Proyecto

source: Last modified
es: Modificado por última vez

source: Last build
es: Construído por última vez

source: Successful
es: Exitoso

source: You don't have any projects yet.
es: Aún no tienes ningún proyecto.

source: Create New Project
es: Crear Nuevo Proyecto

source: Project name
es: Nombre del Proyecto

source: Project type
es: Tipo de Proyecto

source: Empty project
es: Poyecto vacío

source: Standard Templates
es: Plantillas Estándar

source: SDK demos
es: Demos de SDK

source: Examples
es: Ejemplos

source: Cancel
es: Cancelar

source: Import Existing Project
es: Importar Proyecto Existente

source: Upload Zip
es: Cargar Zip

source: Import from GitHub
es: Importar desde GitHub

source: Zip file
es: Archivo Zip

source: This must be a zip file containing a standard Pebble project.
es: Debe ser un archivo zip con un proyecto de Pebble estándar

source: GitHub Project
es: Proyecto de GitHub

source: Branch (optional)
es: Rama (opcional)

source: Use as Git remote
es: Usar como Git remoto

source: Compilation
es: Compilación

source: Source files
es: Archivos de origen

source: Add new
es: Añadir nuevo

source: Worker source
es: Código trabajador

source: Resources
es: Recursos

source: Preparing autocomplete…
es: Preparando auto completado...

source: Create new file
es: Crear archivo nuevo

source: File type
es: Tipo de archivo

source: C file
es: Archivo C

source: JavaScript file
es: Archivo JavsScript

source: Window Layout
es: Disposición de la ventana

source: Filename
es: Nombre de archivo

# compilation target
source: Target
es: Destino

source: App / Watchface
es: Aplicación/ Esfera

source: Background worker
es: Trabajador en segundo plano

source: Create header
es: Crear cabecera

source: Window name
es: Nombre de la ventana

source: That repo does not exist. Would you like to create it?
es: El repositorio no existe. ¿Quieres crearlo?
ru: Такой репозиторий не существует. Хотите создать его?

source: Repo Name
es: Nombre del repositorio

source: Description <span class="muted">(optional)</span>
es: Descripción <span class="muted">(opcional)</span>

source: Push New Commit
es: Enviar salvado nuevo

source: Commit Summary
es: Resumen del salvado

# sample commit summary
source: Fix something useful.
es: Arreglo de algo útil.

source: Extended description <span class="muted">(optional)</span>
es: Descripción extendida <span class="muted">(opcional)</span>

source: Commit
es: Salvado

source: Pull Latest Commit
es: Recuperar último salvado

source: <p>Are you sure you want to pull the latest commit? Doing so will <em>overwrite</em> everything currently in your project.</p> <p>There will be no further warnings and no opportunity to merge. This cannot be undone.</p>
es: <p>¿Estás seguro de querer recuperar el último salvado? Si lo haces <em>sobreescribirás</em> todo en tu proyecto actual.</p> <p>No habrán más avisos ni ocasión de mezclar. No se puede deshacer.</p>

source: Pulling latest commit from GitHub…
es: Recuperando último salvado desde GitHub...

# button label
source: Pull
es: Recuperar

source: Install App
es: Instalar aplicación

source: Installing app on your watch…
es: Instalando la aplicación en tu reloj...
ru: Устанавливаем приложение на часы…

source: Dismiss
es: Ignorar

# button to look at logs
source: View logs
es: Ver registro

source: Taking Screenshot
es: Capturando pantalla

source: Taking screenshot…
es: Capturando pantalla...

source: Okay
es: De acuerdo

source: Continue
es: Continuar

source: Editor settings
es: Ajustes del editor

source: Settings saved!
es: ¡Ajustes guardados!

source: Submit
es: Submitir

source: Reset
es: Resetear

source: GitHub Integration
es: Integración con GitHub

source: Re-authenticate
es: Re-autenticar

source: Unlink account
es: Desvincular cuenta

source: Link your GitHub account
es: Vincular tu cuenta de GitHub

source: Connecting your GitHub account enables you to connect your projects to GitHub repositories.
es: Conectar tu cuenta de GitHub habilita la conexión de tus proyectos con los repositorios de GitHub

source: Install and Run
es: Instalar y ejecutar

source: View app logs
es: Ver registro de la aplicación

source: Screenshot
es: Captura de Pantalla

source: Started:
es: Empezado:

source: Build time:
es: Tiempo de construcción:

source: Status:
es: Estado:

source: Size:
es: Tamaño:

source: Available App RAM:
es: RAM disponible para la aplicación:

source: Available Worker RAM:
es: RAM disponible para el trabajador:

source: Run build
es: Ejecutar construcción

source: Get PBW
es: Obtener PBW

source: Build log
es: Registro construcción
ru: Лог сборки

source: Date
es: Fecha

source: Status
es: Estado

source: Size
es: Tamaño

source: Github Repo
es: Repositorio de GitHub

# git branch
source: Branch
es: Rama

# button label
source: Pull changes
es: Traer cambios

source: Manually
es: Manualmente

source: Automatically
es: Automáticsmente

source: If you select 'Automatically', the contents of this project <em>will be overwritten</em> every time you push to your repo from elsewhere, <em>without prompting you</em>.
es: Si seleccionas "Automáticamente", el contenido de este proyecto <em>será sobreescrito</em> cada vez que envíes a tu repositorio desde cualquier otra parte, <em>sin preguntarte</em>.

source: After pulling
es: Después de traer

source: Do nothing
es: No hacer nada

source: Build automatically
es: Construir automáticamente

source: Save
es: Guardar
ru: Сохранить

source: Resource type
es: Tipo de recurso

source: PNG image
es: Imagen PNG

source: PNG with transparency
es: PNG con transparencia

source: TrueType font
es: Fuente TrueType

source: Raw binary blob
es: Objeto binario opaco

source: File
es: Archivo

source: You can have multiple Pebble resources from a single file (for different sizes, etc.)
es: Puedes tener varios recursos de Pebble por cada archivo (para distintos tamaños, etc.)

source: Download uploaded resource
es: Descargar recurso cargado

source: Identifier
es: Identificador
ru: Идентификатор

source: This is used in your code and must be a valid C identifier.
es: Esto es usado en tu código y debe ser un identificador de C válido.

source: It must end with the desired font size.
es: Debe terminar con el tamaño de fuente deseado.

# like letters and numbers
source: Characters
es: Caracteres

source: A PCRE regular expression that restricts characters.
es: Una expresión regular de PCRE que restringa caracteres.
ru: Регулярное выражение (PCRE) для ограничения символов.

source: Tracking adjust
es: Arreglar Ajuste

source: Number of additional pixels by which to shift each character.
es: Número de píxeles adicionales para cambiar cada caracter.

source: Delete
es: Borrar
ru: Удалить

source: Another font
es: Otra fuente

source: App kind
es: Tipo de aplicación

source: Watchapp
es: Aplicación

source: Watchface
es: Esfera

source: Short App Name
es: Nombre corto

# sample app name
source: Demo App
es: Aplicación de ejemplo

source: App's short name. This will appear on the watch.
es: El nombre corto de la aplicación. Aparecerá en el reloj.

source: Long App Name
es: Nombre largo

source: App's long name. This will appear in the app list on the phone.
es: Nombre largo de la aplicación. Aparecerá en la lista de aplicaciones en el teléfono.

source: Menu image
es: Imagen del menú

source: None
es: Ninguno

source: Default
es: Por defecto

source: Displayed on the Pebble's main menu. Must be a 28x28 file in PNG format.
es: Se muestra en el menú principal del Pebble. Debe ser un archivo de 28x28 en formato PNG.

source: Company Name
es: Nombre de compañía

# sample company name
source: Demo Company
es: Compañía de ejemplo

source: Name of the app's developer.
es: Nombre del desarrollador de la aplicación.

source: Version label
es: Etiqueta de versión

source: App version. Takes the format major[.minor], where major and minor are between 0 and 255.
es: Versión de la aplicación. Toma el formato mayor[.menor], dónde mayor y menor están entre 0 y 255.

source: App UUID
es: UUID de la aplicación

source: A unique identifier for the app.
es: Un identificador único de la aplicación.

source: PebbleKit JS Message Keys
es: Claves de Mensaje de PebbleKit JS

source: Key Name
es: Nombre de Clave

source: Key ID
es: Código de Clave

source: New Entry
es: Nueva entrada
ru: Новая запись

source: A mapping from strings to integers used by PebbleKit JS.
es: Un mapeo de cadena a entero usado por PebbleKit JS.

# checkbox label
source: Check Javascript
es: Comprobar Javascript

# checkbox label
source: Uses Location
es: Usa localización

source: Save changes
es: Guardar cambios

source: Download as zip
es: Descargar como zip

source: Delete Project
es: Borrar proyecto
ru: Удалить проект

source: Properties
es: Propiedades

source: Toolkit
es: Herramientas

source: Illegal include '%(include)s' -> '%(path)s'
es: Include ilegal '%(include)s' -> '%(path)s'

source: No project root found.
es: No se ha encontrado el proyecto raíz.

source: Unknown project type %s
es: Tipo de proyecto desconocido %s

source: CloudPebble was created by Katharine Berry and is now run by Pebble.
es: CloudPebble fue creado por Katharine Berry y ahora lo mantiene Pebble.

source: Welcome Back
es: Bienvenido de nuevo

source: Here's what's changed since the last time you were here:
es: Esto es lo que ha cambiado desde la última vez que estuviste:

source: Sign in
es: Acceder

source: Close
es: Cerrar

source: Already have a Pebble account?
es: ¿Ya tienes una cuenta de Pebble?

source: This is the same account you use to log in to the Pebble Forums, Developer Portal and phone app. Don't have a Pebble account? Create one!
es: Esta es la misma cuenta que usas para acceder a los foros de Pebble, al portal de desarrollador y a la splicsción del teléfono. ¿No tienes una cuenta de Pebble? ¡Crea una!

source: Log in with your Pebble account
es: Accede con tu cuenta de Pebble

source: Create Pebble account
es: Crear cuenta de Pebble

source: Have a legacy CloudPebble account?
es: ¿Tienes una antigua cuenta de CloudPebble?

source: Log in to link it with your Pebble account. Legacy accounts are being phased out in favour of the Pebble account system. Once you log in you will be required to link your accounts; henceforth you must log in with your pebble account.
es: Accede para vincularla con tu cuenta de Pebble. Las cuentas antiguas se están reemplazando con el sistema de cuentas de Pebble. Una vez accedas se te pedirá que vincules tus cuentas; desde entonces deberás acceder con tu cuenta de pebble.

source: Link to your Pebble account
es: Enlace a tu cuenta de Pebble

source: Online Pebble Development
es: Desarrollo de Pebble en línea

source: Write apps without dealing with Linux, virtual machines, compilers, or Python.
es: Escribe aplicaciones sin tener que lidiar con Linux, máquinas virtuales, compiladores o Python.

source: Get Started
es: Comenzar

source: Nothing to install
es: Nada que instalar

source: Write apps directly in your browser. Skip all setup instructions!
es: Escribe aplicaciones directamente en tu navegador. ¡Sáltate todas las instrucciones de configuración!

source: No JSON to edit
es: Si JSON que editar

source: Resources are managed through a friendly user interface
es: Los recursos se gestionan desde una interfaz de usuario amigable.

source: Cloudy
es: Nublado

source: It's on the internet. Accessible from anywhere! That's a good thing, right?
es: Está en internet. ¡Es accesible desde cualquier parte! Eso es bueno ¿verdad?

source: More to come
es: Más por llegar

source: This is only the beginning!<br>There's much more to come.
es: ¡Esto es sólo el principio!<br>Hay mucho más por llegar.

source: Log in with legacy account
es: Accede con una cuenta antigua

source: Username
es: Nombre de usuario

source: Password
es: Contraseña

source: Log in
es: Acceder

source: You have one unsaved source file. If you leave this page, you will lose it.
es: Tienes un archivo sin salvar. Si abandonas esta página lo perderás.
ru: У вас есть несохраненный файл. Если вы покинете эту страницу, вы его потеряете.

source: build log
es: Registro construcción

source: Something went wrong: %s
es: Algo fué mal: %s
ru: Что-то пошло не так: %s

source: %(total)s KiB (%(resources)s KiB resources, %(appbin)s KiB binary)
es: %(total)s KiB (%(resources)s KiB recursos, %(appbin)s KiB binarios)
ru: %(total)s КиБ (%(resources)s КиБ ресурсов, %(appbin)s КиБ код)

source: %(total)s KiB (%(resources)s KiB resources, %(appbin)s KiB binary, %(workerbin)s KiB worker)
es: %(total)s KiB (%(resources)s KiB recursos, %(appbin)s KiB binario, %(workerbin)s KiB trabajador en segundo plano)
ru: %(total)s КиБ (%(resources)s КиБ ресурсов, %(appbin)s КиБ код, %(workerbin)s КиБ работник)

source: Different app crashed. Only the active app has debugging information available.
es: Una aplicación distinta falló. Sólo la aplicación activa tiene disponible información de depuración.
ru: Другое приложение упало. Информация для отладки доступна только для активного приложения.

source: Looking up debug information...
es: Buscando información de debug...
ru: Просматривая информацию для отладки…

source: Crashed inside firmware call.
es: Fallo dentro de una llamada al firmware.
ru: Приложение упало внутри вызова прошивки.

source: Crashed at %(file)s:%(line)s, in %(fn_name)s (starts at %(file)s:%(fn_line)s).
es: Falló en %(file)s:%(line)s, en %(fn_name)s (comienzo en %(file)s:%(fn_line)s).
ru: Приложение упало на %(file)s:%(line)s, функция %(fn_name)s (начиная с %(file)s:%(fn_line)s).

source: Which was called from %(file)s:%(line)s, in %(fn_name)s (starts at %(file)s:%(fn_line)s).
es: El cual fue llamado desde %(file)s:%(line)s, in %(fn_name)s (comienza en %(file)s:%(fn_line)s).
ru: Которая была вызвана из %(file)s:%(line)s, функция %(fn_name)s (начиная с %(file)s:%(fn_line)s).

source: [PHONE]
es: [TELÉFONO]

source: [WARNING]
es: [ADVERTENCIA]

source: [DEBUG]
es: [DEPURAR]

source: [VERBOSE]
es: [VERBOSO]

source: Something went wrong: %s
es: Algo fué mal: %s
ru: Что-то пошло не так: %s

source: This file has been edited elsewhere; you will not be able to save your changes.
es: Este archivo ha sido editado desde otro sitio; no podrás guardar tus cambios.
ru: Этот файл был изменен где-то ещё; вы не сможете сохранить изменения здесь.

source: Save, build, install and run
es: Guardar, construir, instalar y ejecutar
ru: Сохранить, собрать, установить и запустить

source: Reload
es: Recargar
ru: Откат

source: UI Editor
es: Editor UI
ru: Редактор UI

source: Do you want to delete %(name)s?
es: ¿Deseas borrar %(name)s?
ru: Вы хотите удалить %(name)s?

source: This cannot be undone.
es: No se puede deshacer.
ru: Это невозможно отменить.

source: Do you want to reload %(name)s?
es: ¿Deseas recargar %(name)s?
ru: Вы хотите откатить %(name)s?

source: This will discard your current changes and revert to the saved version.
es: Se descartarán los cambios actuales y volverá a la versión guardada.
ru: Это отменит текущие изменения и вернет код к сохраненной версии.

source: Saving...
es: Guardando...
ru: Сохраняем…

source: Compiling...
es: Compilando...
ru: Компилируем…

source: Toggle Fullscreen
es: Cambiar a Pantalla Completa
ru: Полноэкранный режим

source: Declaration
es: Declaración
ru: Объявление

source: Description
es: Descripción
ru: Описание

source: Returns
es: Volver
ru: Возвращает

source: Parameters
es: Parámetros
ru: Параметры

source: Note
es: Nota
ru: Заметка

source: Source files must end in .c or .h
es: Los ficheros fuente deben acabar en .c o .h
ru: Исходные файлы должны заканчиваться на .c или .h

source: A file called '%s' already exists.
es: Ya existe un fichero llamado'%s'.
ru: Файл '%s' уже существует.

source: Source files must end in .js
es: Los ficheros fuente deben acabar en .js
ru: Исходные файлы должны заканчиваться на .js

source: You must specify a valid window name using lowercase letters and underscores.
es: Debes especificar un nombre de ventana válido usando letras minúsculas y guiones bajos.
ru: Вы должны указать валидное название окна используя строчные латинские буквы и подчеркивания.

source: That name is already used in this project.
es: Ese nombre ya está en uso en este proyecto.
ru: Это имя уже используется в проекте.

source: If you want to create a background worker, use this dropdown to create files pointing at that target.
es: Si quieres crear n trabajador en segundo plano, usa este desplegable para crear archivos apuntando a ese destino.
ru: Если вы хотите создать фоновый процесс, используйте этот выпадающий список, что бы создать файлы, указывающие а эту цель.

source: Note that targets are independent and code will not be shared between them.
es: Ten en cuenta que los destinos son independientes y el código no se compartirá entre ellos.
ru: Заметьте, что цели независимы, и код не будет связан между ними.

source: Import failed: %s
es: Importación fallida: %s
ru: Импорт не удался: %s

source: Updated repo.
es: Repositorio actualizado.
ru: Обновили репозиторий.

source: You don't have access to that repository.
es: No tienes acceso a ese repositorio.
ru: У вас нет доступа к этому репозиторию.

source: You must provide a repo URL.
es: Debes proporcionar la URL al repositorio.
ru: Вы должны предоставить URL репозитория.

source: Pulled successfully.
es: Recuperado con éxito.
ru: Pull выполнен успешно.

source: Pull completed successfully.
es: Recuperación completada con éxito.
ru: Pull успешно завершен.

source: Pull completed: Nothing to pull.
es: Recuperación completada: nada que recuperar.
ru: Pull завершен: Нет изменений.

source: You must provide a commit summary.
es: Debes proporcionar un resumen de salvado.
ru: Вы должны кратко описать коммит.

source: Pull failed: %s
es: Recuperación fallida: %s
ru: Pull не удался: %s

source: GitHub integration can be enabled in your user settings by linking a GitHub account.
es: La integración con GitHub se puede activar en los ajustes de usuario vinculando una cuenta de GitHub.
ru: Интеграция с GitHub может быть включена в настройках привязкой аккаунта GitHub.

source: You must enter a name.
es: Debes introducir un nombre.
ru: Вы должны указать имя.

source: You must specify a project name.
es: Debes especificar un nombre de proyecto.
ru: Вы должны указать имя проекта.

source: You must upload a zip file.
es: Debes cargar un archivo zip.
ru: Вы должны загрузить zip файл.

source: You must specify a complete GitHub project URL
es: Debes especificar la URL completa a un proyecto de GitHub
ru: Вы должны указать полный URL проекта на GitHub.

source: You must upload a file.
es: Debes cargar un archivo.
ru: Вы должны загрузить файл.

source: A resource called '%(name)s' already exists in the project.
es: Un recurso llamado '%(name)s' ya existe en el proyecto.
ru: Ресурс '%(name)s' уже есть в проекте.

source: You must upload a PNG image.
es: Debes cargar una imagen PNG.
ru: Вы должны загрузить картинку PNG.

source: You must upload a TrueType Font (.ttf)
es: Debes cargar una fuente TrueType (.ttf)
ru: Вы должны загрузить шрифт TrueType (.ttf).

source: You must provide a valid resource identifier. Use only letters, numbers and underscores.
es: Debe introducir un identificador de recurso válido. Utilice solo letras, números y guiones bajos.
ru: Вы должны указать валидный идентификатор ресурса. Используйте только буквы, цифры и подчеркивание.

source: Invalid resource identifier. Use only letters, numbers and underscores.
es: Identificador de recurso inválido. Utilice solamente letras, números y guiones bajos.
ru: Идентификатор ресурса не валидный. Используйте только буквы, цифры и подчеркивание.

source: Font resource identifiers must end with the desired font size, e.g. %s_24
es: Los identificados de recursos de Fuente deben terminar con el tamaño de fuente deseado, p.ej. %s_24
ru: Идентификаторы ресурсов шрифтов должны заканчиваться предпочитаемым размером шрифта, например %s_24

source: You can't have multiple identical identifiers. Please remove or change one.
es: No puedes tener múltiples identificadores idénticos. Por favor, elimina o cambia uno.
ru: У вас не может быть одинаковых идентификаторов. Удалите или измените один.

source: Tracking must be an integer.
es: Ajuste debe ser un entero
ru: Трекинг должен быть целым числом.

source: You must specify at least one resource.
es: Debes especificar al menos un recurso.
ru: Обязательно указать хотя бы один ресурс.

source: If specified, this file will replace the current file for this resource, regardless of its filename.
es: Si se especifica, este archivo reemplazará el fichero actual para este recurso independientemente del nombre del archivo.
ru: Если указано, этот файл заменит текущий файл для этого ресурса, вне зависимости от его названия.

source: Preview
es: Previsualizar
ru: Предпросмотр

source: Do you want to delete %s?
es: ¿Deseas eliminar %s?
ru: Вы хотите удалить %s?

source: You must specify a project name
es: Debes especificar un nombre de proyecto
ru: Вы должны указать имя проекта.

source: You must specify a short name.
es: Debes especificar un nombre corto.
ru: Вы должны указать короткое имя.

source: You must specify a long name.
es: Debes especificar un nombre largo.
ru: Вы должны указать длинное имя.

source: You must specify a company name.
es: Debes especificar un nombre de compañía.
ru: Вы должны указать имя компании.

source: You must specify a positive integer version code.
es: Debes especificar una versión de código entera positiva.
ru: Вы должны указать код версии (положительное целое число).

source: You must specify a valid version number.
es: Debes especificar un número de versión válido.
ru: Вы должны указать валидный номер версии.
