Repository: 123outerme/cloudpebble
Catalog: locale/*/LC_MESSAGES/djangojs.po
Languages: es, ru

source: You must specify a valid UUID (of the form 00000000-0000-0000-0000-000000000000)
es: Debe especificar un UUID válido (de la forma 00000000-0000-0000-0000-000000000000)
ru: Вы должны указать валидный UUID (вида 00000000-0000-0000-0000-000000000000)

source: Settings saved.
es: Ajustes guardados.
ru: Настройки сохранены.

source: Are you sure you want to delete this project? THIS CANNOT BE UNDONE.
es: ¿Seguro que quieres eliminar este proyecto?ESTO NO SE PUEDE DESHACER.
ru: Вы точно хотите удалить этот проект? ЭТО НЕЛЬЗЯ ОТМЕНИТЬ.

source: App source
es: Código aplicación
ru: Код прил-я

source: Code completion resync failed.
es: Ha fallado la sincronización del completado de código.
ru: Ресинхронизация автодопления не удалась.

source: Code completion unavailable.
es: Completado de código no disponible
ru: Автодополнение недоступно.

source: Code completion lost; retrying...
es: Completado de código desconectado; reintentando…
ru: Автодополнение потеряно; повтор…

source: %(free)s / %(max)s bytes (%(percent)s%)
ru: %(free)s / %(max)s байт (%(percent)s%)

source: Error: %s
ru: Ошибка: %s

# month name
source: January
ru: Январь

# month name
source: February
ru: Февраль

# month name
source: March
ru: Март

# month name
source: April
ru: Апрель

# month name
source: May
ru: Май

# month name
source: June
ru: Июнь

# month name
source: July
ru: Июль

# month name
source: August
ru: Август

# month name
source: September
ru: Сентябрь

# month name
source: October
ru: Октябрь

# month name
source: November
ru: Ноябрь

# month name
source: December
ru: Декабрь

source: %s second
ru: одна секунда

source: Something went wrong: %s
ru: Что-то пошло не так: %s

source: Connecting...
ru: Подключаемся…

source: Establishing connection...
ru: Устанавливаем соединение…

source: Authenticating...
ru: Входим…

source: Waiting for phone. Make sure the development server is enabled.
ru: Ожидание телефона. Убедитесь, что сервер разработки включен.

source: Connection interrupted.
ru: Соединение прервано.

source: Please <a href='%(update_url)s'>update your pebble</a> to %(min_version)s to install apps from CloudPebble and the appstore (you're on version %(real_version)s).
ru: Пожалуйста, <a href='%(update_url)s'>обновите ваш Pebble</a> до %(min_version)s для установки приложений из CloudPebble и App Store (сейчас у вас %(real_version)s).

source: Installed successfully!
ru: Успешно установлено!

source: Installation failed. Check your phone for details.
ru: Не получилость установить. Проверьте ваш телефон.

source: Disconnected from phone.
ru: Отключено от телефона.

source: Connected.
ru: Подключено.

source: Right click -> Save Image as...
ru: Правый клик -> Сохранить изображение как…

# background colour
source: Background
ru: Цвет фона

source: Fullscreen
ru: Полный экран

source: Position
ru: Позиция

source: Delete layer
ru: Удалить слой

source: White
ru: Белый

source: Black
ru: Черный

source: Transparent
ru: Прозрачный

source: Top icon
ru: Верхняя иконка

source: Middle icon
ru: Средняя иконка

source: Bottom icon
ru: Нижняя иконка

source: ActionBarLayer is a Layer that displays a bar on the right edge of the window. The bar can contain up to 3 icons, each corresponding with one of the buttons on the right side of the watch.
ru: ActionBarLayer – это слой, отображающий полосу справа окна. Полоса может содержать до трех иконок, каждая из которых соответствует одной из кнопок на правом торце часов.

source: Image
ru: Изображение

source: BitmapLayer will display an opaque bitmap image.
ru: BitmapLayer отобразит непрозрачное изображение.

source: Inverts the colours of the rectangle behind it. Layers in front are unaffected.
ru: Инвертирует цвета внутри прямоугольника под ним. Верхние слои не затрагиваются.

source: A menu that pulls its content from programmatic callbacks.
ru: Меню, которое получает содержимое из обратных вызовов.

source: Text
ru: Текст

# sample text
source: Text layer
ru: Слой текста

source: Font
ru: Шрифт

source: Text colour
ru: Цвет текста

# horizontal text positioning
source: Alignment
ru: Расположение

source: Left
ru: Слева

source: Centre
ru: Справа

source: Right
ru: По центру

source: Displays text.
ru: Отображает текст.
